[
  {
    "reviewName": "Виктория Корнейчук",
    "starsAmount": 5,
    "reviewText": "Велика подяка Ігорю Миколаєвичу! Викладач завдяки якому теоретичний та практичний іспити  були здані з першого разу. Викладач який вчить стати водієм, бути впевненим на дорозі та орієнтуватись у різних ситуаціях, а не просто від'їздити маршрути. Дуже вдячна за професіоналізм, потрібний підхід, терплячість та підтримку!",
    "reviewLink": "https://maps.app.goo.gl/hqDZmLQ5Rm1sghMP7",
    "profileImageLink": "ViktoriaKorneychuk.png"
  },
  {
    "reviewName": "Влада Ільчук",
    "starsAmount": 5,
    "reviewText": "Однозначно рекомендую автошколу ,,Сигналʼʼ, а особливо хочеться подякувати неймовірним викладачам Олександру Федоровичу,який доступно,зрозуміло і цікаво пояснює теорію та неймовірно крутому, позитивному, компетентному Олександру Івановичу!!!\nКожний урок для мене був як особливою терапією,коли ти можеш навіть ще навчаючись отримувати насолоду від водіння це неймовірно круто!!!Підтримка і віра в себе завдяки Олександру Івановичу!!!І його «ну це було кайфово» для мене це найвища точка похвали))) І в результаті практичний іспит з впевненістю було складено з першого разу🥳Дякую вам величезне!!!!",
    "reviewLink": "https://maps.app.goo.gl/gDsGMTThebPb8zGc7",
    "profileImageLink": "Vlada.png"
  },

  {
    "reviewName": "Марина",
    "starsAmount": 5,
    "reviewText": "Щиро вдячна інструктору Ігорю Миколайовичу за те, що пройшов зі мною цей, здавалось, нескінченний шлях від «я ніколи не зможу сісти за кермо» до омріяного «вітаю, іспит складено» з першого разу.\nТеорія - самопідготовка. Практика - 20 занять, плюс сам іспит. Години для виїздів підбирали індивідуально, були і о сьомій ранку, і на вихідні. Машина шкода Рапід в хорошому технічному стані. Сам інструктор вчить їздити в реальних умовах, не лише по маршрутам для здачі іспиту. Найстресовішим був процес вихопити талончик на здачу практики на машині автошколи. Сподіваюсь, цей момент скоро налагодять, але до автошколи це не має жодного відношення.\nОтримати права без хабаря - реально! Бажаю вам не помилитись із вибором інструктора та вірити у себе!",
    "reviewLink": "https://maps.app.goo.gl/q1Xd67h8rh8Hbi3j9",
    "profileImageLink": "Marina.png"
  },
  {
    "reviewName": "Victoria Voloshyna",
    "starsAmount": 5,
    "reviewText": "Рекомендую автошколу і свого інструктора Ігоря Миколайовича. Навчалась у нього теорії та практиці, дякую за професіоналізм та доступні пояснення. Якщо ви хочете не лише здати іспит, а й навчитись добре їздити та впевнено почуватись на дорозі – вам до Ігоря Миколайовича.\nТакож хочу зауважити, що автомобілі досить сучасні, навчатись їздити було комфортно.",
    "reviewLink": "https://maps.app.goo.gl/xxs9m1ozoqY1tcEM7",
    "profileImageLink": "ViktoriyaVoloshyna.png"
  },
  {
    "reviewName": "Максим Войтко (МіТ-23б)",
    "starsAmount": 5,
    "reviewText": "Хочу висловити щиру подяку автошколі за чудову організацію навчального процесу та високий рівень професіоналізму інструкторів. Особливу вдячність хочу висловити своєму інструктору Ігору Миколайовичу. Він справжній професіонал своєї справи, який завжди спокійно та зрозуміло пояснював всі моменти, надавав корисні поради та підтримував на кожному етапі навчання. Завдяки його терплячості й майстерності я швидко навчився впевнено керувати автомобілем. Рекомендую цю автошколу всім, хто хоче отримати не лише знання, а й справжню впевненість за кермом!",
    "reviewLink": "https://maps.app.goo.gl/PaY7T6x31gHAv7Pw8",
    "profileImageLink": "Maksym.png"
  },
  {
    "reviewName": "Віта Гончарук",
    "starsAmount": 5,
    "reviewText": "Однозначно рекомендую автошколу \"Сигнал\". Тут навчались багато моїх знайомих, тому вибір випав саме на неї. Подяка Ігорю Миколайовичу за навчання теорії, все чітко і доступно пояснював,з прикладами зі свого досвіду ,тому теорія здана з першого разу 20 з 20 ✅.\nОкрема подяка Олегу Сергійовичу,викладачу практики. За його терпіння,вміння пояснювати і гумор( обійшлось навіть без сліз😅) Навчав їздити не лише по маршрутах , а для повсякденного водіння по місту. Пояснював парковку,аж допоки я не зрозуміла.\nЗавдяки цьому, екзамен з практики також зданий з першого разу,лише з однією помилкою ✅😅\nТому щиро рекомендую викладачів і автошколу,якщо дійсно хочете навчитись водити авто.🔥🚗",
    "reviewLink": "https://maps.app.goo.gl/NHwyNGNyLUvicRRMA",
    "profileImageLink": "Vita.png"
  },
  {
    "reviewName": "Ірина",
    "starsAmount": 5,
    "reviewText": "Щиро вдячна викладачу Ігорю Миколайовичу за те, що з нуля навчив мене всім тонкощам як теорії, так і практики. Дякую за терпіння та професіоналізм. Завдяки його методам навчання я відчула впевненість за кермом і успішно склала іспити з першого разу)",
    "reviewLink": "https://maps.app.goo.gl/hEDJP1HU2R258TqFA",
    "profileImageLink": "Irina.png"
  },
  {
    "reviewName": "Анна-Марія Кукліна",
    "starsAmount": 5,
    "reviewText": "Хочу висловити щиру подяку автошколі «Сигнал» за якісне навчання.\nДякую Ігорю Миколайовичу за цікаву теорію та Олегу Сергійовичу за круту практику, все було доступно пояснено, весело та корисно\nВикладачі були професіоналами своєї справи!\nРекомендую всім, хто хоче отримати якісну освіту водія!",
    "reviewLink": "https://maps.app.goo.gl/7732kkFzx6T2pYpe6",
    "profileImageLink": "Anna-Maria.png"
  },
  {
    "reviewName": "Катерина Барчук",
    "starsAmount": 5,
    "reviewText": "Найкраща автошкола, з особистого досвіду, так як перейшла з іншої школи.\nОкрема і ВЕЛИКА подяка інструктору Олександру Івановичу🤩\nДуже спокійно, чітко і доступно все пояснював. Були цінні поради, які я використовувала на практиці та буду використовувати надалі.\nСамі заняття проходили на позитиві і з легкістю.\nДякую за підтримку на самому іспиті, це дуже цінно. І завдяки цьому іспит було складено з першого разу🙏🏻❤️",
    "reviewLink": "https://maps.app.goo.gl/BdVFj6ra5hMPWzvA8",
    "profileImageLink": "Katerina.png"
  },
  {
    "reviewName": "Valeriia Kondratska",
    "starsAmount": 5,
    "reviewText": "Дякую за терпіння, витримку, знання і вміння докладно і дохідливо пояснювати тонкощі управління автомобілем.\nКрок за кроком, долаючи мою невпевненість, Олег Сергійович допоміг мені опанувати водіння.\nВаше відповідальне ставлення до справи, знання особливостей поведінки, уміння «Відчувати» і «чути» автомобіль викликають повагу і захоплення.",
    "reviewLink": "https://maps.app.goo.gl/AqTdTJa6mzXhSbtp7",
    "profileImageLink": "ValeriaKondratska.png"
  },
  
  {
    "reviewName": "Марина Ярошевська",
    "starsAmount": 5,
    "reviewText": "Щиро дякую Ігореві  Миколайовичу за уроки водіння! Завдяки Вам, мені вдалося набути основних навичок керування автомобілем, побороти страх водіння та водіння по місту скласти нарешті іспит. Навчання із Вами було цікаве та сповнене експериментів, які дали необхідні результати. Ваш метод навчання є найкращим. Якщо Ви хочете стати справжній водієм, а не просто отримати права, то Вам потрібен саме цей інструктор.  Дякую за Вашу професійну майстерність та витримку! Завдяки Вам я повірила в себе, навчилася опановувати та приборкала страх перед водінням. Ігор Миколайович Ви найкращий Вчитель! Дякую Вам за те , що ви робите:)",
    "reviewLink": "https://maps.app.goo.gl/NH7fu5rjq438PRjz5",
    "profileImageLink": "MarinaYaroshevska.png"
  },
  {
    "reviewName": "Лілія Хотячук",
    "starsAmount": 5,
    "reviewText": "Чудова автошкола, якісні знання і навички водіння.\nТеорію викладав Олександр Федорович, надзвичайно зрозуміло пояснював правила дорожнього руху.\nДуже хочу подякувати своєму інструктору з водіння Олександру Івановичу. Це просто НАЙКРАЩИЙ  інструктор, якого я могла собі уявити!! Він професіонал у своїй справі: на заняттях все чітко, доступно і спокійно пояснював, давав цінні поради і підказки, як діяти в різних ситуаціях на дорозі.\nЗаняття проходили легко і весело, щоразу дізнавалась багато нового, з Олександром Івановичем об‘їздила всю Вінницю, знаю нюанси проїзду різних ділянок дороги.\nБезмежно вдячна за знання і вміння, здала теорію і практику з першого разу.\nОбов‘язково буду рекомендувати друзям і знайомим!",
    "reviewLink": "https://maps.app.goo.gl/skSwYGbVTuxz4tWs7",
    "profileImageLink": "LiliaHotyachuk.png"
  }


]
